CSI API ETABS v1

# cSapModelView Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cView View { get; }

    ReadOnly Property View As cView
    	Get

    Dim instance As cSapModel
    Dim value As cView

    value = instance.View

    property cView^ View {
    	cView^ get ();
    }

    abstract View : cView with get

#### Property Value

Type: cView

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com